garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q71.PIC
        <edc:SFRDef edc:access="n-nnnn-n" edc:cname="DAC2CON" edc:desc="" edc:impl="0x3c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000-0" edc:name="DAC2CON" edc:nzwidth="8" edc:por="0-0000-0" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xC2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x3" edc:name="OE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DAC2NSS" edc:mask="0x1" edc:name="DAC2NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS0" edc:mask="0x1" edc:name="DAC2PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS1" edc:mask="0x1" edc:name="DAC2PSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC2OE" edc:mask="0x3" edc:name="DAC2OE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="DAC2EN" edc:mask="0x1" edc:name="DAC2EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OE0" edc:mask="0x1" edc:name="OE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:mask="0x1" edc:name="OE1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DAC3DAT" edc:desc="" edc:name="DAC3DAT" edc:nzwidth="0x10" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xC3">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC3DATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC3DATL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xC3">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DAC3R" edc:mask="0xff" edc:name="DAC3R" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC3R0" edc:mask="0x1" edc:name="DAC3R0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3R1" edc:mask="0x1" edc:name="DAC3R1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3R2" edc:mask="0x1" edc:name="DAC3R2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3R3" edc:mask="0x1" edc:name="DAC3R3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3R4" edc:mask="0x1" edc:name="DAC3R4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3R5" edc:mask="0x1" edc:name="DAC3R5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3R6" edc:mask="0x1" edc:name="DAC3R6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3R7" edc:mask="0x1" edc:name="DAC3R7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="DAC3RL" edc:mask="0xff" edc:name="DAC3RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0xC4"/>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-nnnn-n" edc:cname="DAC3CON" edc:desc="" edc:impl="0x3c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000-0" edc:name="DAC3CON" edc:nzwidth="8" edc:por="0-0000-0" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xC5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x3" edc:name="OE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DAC3NSS" edc:mask="0x1" edc:name="DAC3NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC3PSS0" edc:mask="0x1" edc:name="DAC3PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC3PSS1" edc:mask="0x1" edc:name="DAC3PSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC3OE" edc:mask="0x3" edc:name="DAC3OE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="DAC3EN" edc:mask="0x1" edc:name="DAC3EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OE0" edc:mask="0x1" edc:name="OE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:mask="0x1" edc:name="OE1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xE" edc:_addr="0xC6"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLCDATA" edc:desc="" edc:impl="0x80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CLCDATA" edc:nzwidth="8" edc:por="00000000" edc:_addr="0xD4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLC1OUT" edc:mask="0x1" edc:name="CLC1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2OUT" edc:mask="0x1" edc:name="CLC2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC3OUT" edc:mask="0x1" edc:name="CLC3OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4OUT" edc:mask="0x1" edc:name="CLC4OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5OUT" edc:mask="0x1" edc:name="CLC5OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6OUT" edc:mask="0x1" edc:name="CLC6OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7OUT" edc:mask="0x1" edc:name="CLC7OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8OUT" edc:mask="0x1" edc:name="CLC8OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CLCSELECT" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CLCSELECT" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02286_cla_clc_v5_8bit_stacked.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0xD5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLCT" edc:mask="0x7" edc:name="SLCT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLCT0" edc:mask="0x1" edc:name="SLCT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLCT1" edc:mask="0x1" edc:name="SLCT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLCT2" edc:mask="0x1" edc:name="SLCT2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
