garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CWG1STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CWG1STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRA" edc:desc="" edc:mask="0x1" edc:name="OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRB" edc:desc="" edc:mask="0x1" edc:name="OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRC" edc:desc="" edc:mask="0x1" edc:name="OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRD" edc:desc="" edc:mask="0x1" edc:name="OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1STRA" edc:desc="" edc:mask="0x1" edc:name="CWG1STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRB" edc:desc="" edc:mask="0x1" edc:name="CWG1STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRC" edc:desc="" edc:mask="0x1" edc:name="CWG1STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRD" edc:desc="" edc:mask="0x1" edc:name="CWG1STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRA" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRB" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRC" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRD" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x12" edc:_addr="0x3C5"/>
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="FVRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu000000" edc:name="FVRCON" edc:nzwidth="8" edc:por="xx000000" edc:_modsrc="DOS-02541_amp_fvr_ts_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x3D7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="Zero-Cross Detect Positive-going Edge Interrupt Enable" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CDAFVR" edc:mask="0x3" edc:name="CDAFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Zero-Cross Detect Polarity bit" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Zero-Cross Detect Data Output" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Zero-Cross Detect Software Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR0" edc:mask="0x1" edc:name="CDAFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR1" edc:mask="0x1" edc:name="CDAFVR1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n------r" edc:cname="ADCPCON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------0" edc:name="ADCPCON" edc:nzwidth="8" edc:por="x------x" edc:_addr="0x3D8">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="ADCP"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPRDY" edc:mask="0x1" edc:name="CPRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCPRDY" edc:mask="0x1" edc:name="ADCPRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="CPON" edc:mask="0x1" edc:name="CPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="ADCPON" edc:mask="0x1" edc:name="ADCPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ADLTH" edc:desc="" edc:name="ADLTH" edc:nzwidth="0x10" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3D9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3D9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LTH" edc:desc="" edc:mask="0xff" edc:name="LTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH0" edc:desc="" edc:mask="0x1" edc:name="ADLTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH1" edc:desc="" edc:mask="0x1" edc:name="ADLTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH2" edc:desc="" edc:mask="0x1" edc:name="ADLTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH3" edc:desc="" edc:mask="0x1" edc:name="ADLTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH4" edc:desc="" edc:mask="0x1" edc:name="ADLTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH5" edc:desc="" edc:mask="0x1" edc:name="ADLTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH6" edc:desc="" edc:mask="0x1" edc:name="ADLTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH7" edc:desc="" edc:mask="0x1" edc:name="ADLTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADLTH" edc:mask="0xff" edc:name="ADLTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="LTH0" edc:mask="0x1" edc:name="LTH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH1" edc:mask="0x1" edc:name="LTH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH2" edc:mask="0x1" edc:name="LTH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH3" edc:mask="0x1" edc:name="LTH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH4" edc:mask="0x1" edc:name="LTH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH5" edc:mask="0x1" edc:name="LTH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH6" edc:mask="0x1" edc:name="LTH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH7" edc:mask="0x1" edc:name="LTH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3DA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LTH" edc:desc="" edc:mask="0xff" edc:name="LTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH8" edc:desc="" edc:mask="0x1" edc:name="ADLTH8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH9" edc:desc="" edc:mask="0x1" edc:name="ADLTH9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH10" edc:desc="" edc:mask="0x1" edc:name="ADLTH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH11" edc:desc="" edc:mask="0x1" edc:name="ADLTH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH12" edc:desc="" edc:mask="0x1" edc:name="ADLTH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH13" edc:desc="" edc:mask="0x1" edc:name="ADLTH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH14" edc:desc="" edc:mask="0x1" edc:name="ADLTH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH15" edc:desc="" edc:mask="0x1" edc:name="ADLTH15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADLTH" edc:mask="0xff" edc:name="ADLTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="LTH8" edc:mask="0x1" edc:name="LTH8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH9" edc:mask="0x1" edc:name="LTH9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH10" edc:mask="0x1" edc:name="LTH10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH11" edc:mask="0x1" edc:name="LTH11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH12" edc:mask="0x1" edc:name="LTH12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH13" edc:mask="0x1" edc:name="LTH13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH14" edc:mask="0x1" edc:name="LTH14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH15" edc:mask="0x1" edc:name="LTH15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADUTH" edc:desc="" edc:name="ADUTH" edc:nzwidth="0x10" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3DB">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADUTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADUTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3DB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="UTH" edc:desc="" edc:mask="0xff" edc:name="UTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADUTH0" edc:desc="" edc:mask="0x1" edc:name="ADUTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH1" edc:desc="" edc:mask="0x1" edc:name="ADUTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH2" edc:desc="" edc:mask="0x1" edc:name="ADUTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH3" edc:desc="" edc:mask="0x1" edc:name="ADUTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH4" edc:desc="" edc:mask="0x1" edc:name="ADUTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH5" edc:desc="" edc:mask="0x1" edc:name="ADUTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH6" edc:desc="" edc:mask="0x1" edc:name="ADUTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH7" edc:desc="" edc:mask="0x1" edc:name="ADUTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADUTH" edc:mask="0xff" edc:name="ADUTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="UTH0" edc:mask="0x1" edc:name="UTH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH1" edc:mask="0x1" edc:name="UTH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH2" edc:mask="0x1" edc:name="UTH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH3" edc:mask="0x1" edc:name="UTH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH4" edc:mask="0x1" edc:name="UTH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH5" edc:mask="0x1" edc:name="UTH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH6" edc:mask="0x1" edc:name="UTH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH7" edc:mask="0x1" edc:name="UTH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADUTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADUTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3DC">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="UTH" edc:desc="" edc:mask="0xff" edc:name="UTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADUTH8" edc:desc="" edc:mask="0x1" edc:name="ADUTH8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH9" edc:desc="" edc:mask="0x1" edc:name="ADUTH9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH10" edc:desc="" edc:mask="0x1" edc:name="ADUTH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH11" edc:desc="" edc:mask="0x1" edc:name="ADUTH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH12" edc:desc="" edc:mask="0x1" edc:name="ADUTH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH13" edc:desc="" edc:mask="0x1" edc:name="ADUTH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH14" edc:desc="" edc:mask="0x1" edc:name="ADUTH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH15" edc:desc="" edc:mask="0x1" edc:name="ADUTH15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADUTH" edc:mask="0xff" edc:name="ADUTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="UTH8" edc:mask="0x1" edc:name="UTH8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH9" edc:mask="0x1" edc:name="UTH9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH10" edc:mask="0x1" edc:name="UTH10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH11" edc:mask="0x1" edc:name="UTH11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH12" edc:mask="0x1" edc:name="UTH12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH13" edc:mask="0x1" edc:name="UTH13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH14" edc:mask="0x1" edc:name="UTH14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH15" edc:mask="0x1" edc:name="UTH15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADERR" edc:desc="" edc:name="ADERR" edc:nzwidth="0x10" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3DD">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADERRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADERRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3DD">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ERR" edc:desc="" edc:mask="0xff" edc:name="ERR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADERR0" edc:desc="" edc:mask="0x1" edc:name="ADERR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR1" edc:desc="" edc:mask="0x1" edc:name="ADERR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR2" edc:desc="" edc:mask="0x1" edc:name="ADERR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR3" edc:desc="" edc:mask="0x1" edc:name="ADERR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR4" edc:desc="" edc:mask="0x1" edc:name="ADERR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR5" edc:desc="" edc:mask="0x1" edc:name="ADERR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR6" edc:desc="" edc:mask="0x1" edc:name="ADERR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR7" edc:desc="" edc:mask="0x1" edc:name="ADERR7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADERR" edc:mask="0xff" edc:name="ADERR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ERR0" edc:mask="0x1" edc:name="ERR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR1" edc:mask="0x1" edc:name="ERR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR2" edc:mask="0x1" edc:name="ERR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR3" edc:mask="0x1" edc:name="ERR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR4" edc:mask="0x1" edc:name="ERR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR5" edc:mask="0x1" edc:name="ERR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR6" edc:mask="0x1" edc:name="ERR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR7" edc:mask="0x1" edc:name="ERR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADERRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADERRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3DE">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ERR" edc:desc="" edc:mask="0xff" edc:name="ERR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADERR8" edc:desc="" edc:mask="0x1" edc:name="ADERR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR9" edc:desc="" edc:mask="0x1" edc:name="ADERR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR10" edc:desc="" edc:mask="0x1" edc:name="ADERR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR11" edc:desc="" edc:mask="0x1" edc:name="ADERR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR12" edc:desc="" edc:mask="0x1" edc:name="ADERR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR13" edc:desc="" edc:mask="0x1" edc:name="ADERR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR14" edc:desc="" edc:mask="0x1" edc:name="ADERR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR15" edc:desc="" edc:mask="0x1" edc:name="ADERR15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADERR" edc:mask="0xff" edc:name="ADERR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ERR8" edc:mask="0x1" edc:name="ERR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR9" edc:mask="0x1" edc:name="ERR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR10" edc:mask="0x1" edc:name="ERR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR11" edc:mask="0x1" edc:name="ERR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR12" edc:mask="0x1" edc:name="ERR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR13" edc:mask="0x1" edc:name="ERR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR14" edc:mask="0x1" edc:name="ERR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR15" edc:mask="0x1" edc:name="ERR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
