garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q71.PIC
        <edc:JoinedSFRDef edc:cname="PWM3S1P2" edc:desc="" edc:name="PWM3S1P2" edc:nzwidth="0x10" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48B">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P2L" edc:mask="0xff" edc:name="S1P2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P2H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P2H" edc:mask="0xff" edc:name="S1P2H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x48D"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PWMLOAD" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PWMLOAD" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x499">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM1LD" edc:mask="0x1" edc:name="MPWM1LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM2LD" edc:mask="0x1" edc:name="MPWM2LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM3LD" edc:mask="0x1" edc:name="MPWM3LD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PWMEN" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PWMEN" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x49A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM1EN" edc:mask="0x1" edc:name="MPWM1EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM2EN" edc:mask="0x1" edc:name="MPWM2EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM3EN" edc:mask="0x1" edc:name="MPWM3EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x49B"/>
        <edc:SFRDef edc:access="rnnnnrnn" edc:cname="IPR0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x49C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIP" edc:mask="0x1" edc:name="SWIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIP" edc:mask="0x1" edc:name="HLVDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIP" edc:mask="0x1" edc:name="OSFIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWIP" edc:mask="0x1" edc:name="CSWIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMIP" edc:mask="0x1" edc:name="NVMIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IP" edc:mask="0x1" edc:name="CLC1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIP" edc:mask="0x1" edc:name="CRCIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIP" edc:mask="0x1" edc:name="IOCIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x49D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IP" edc:mask="0x1" edc:name="INT0IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH1IP" edc:mask="0x1" edc:name="ADCH1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIP" edc:mask="0x1" edc:name="ADIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIP" edc:mask="0x1" edc:name="ACTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1IP" edc:mask="0x1" edc:name="C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH2IP" edc:mask="0x1" edc:name="ADCH2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH3IP" edc:mask="0x1" edc:name="ADCH3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH4IP" edc:mask="0x1" edc:name="ADCH4IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="IPR2" edc:desc="" edc:impl="0x6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="IPR2" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x49E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCDIP" edc:mask="0x1" edc:name="ZCDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5IP" edc:mask="0x1" edc:name="CLC5IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCSRIP" edc:mask="0x1" edc:name="IOCSRIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIP" edc:mask="0x1" edc:name="DMA1SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIP" edc:mask="0x1" edc:name="DMA1DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIP" edc:mask="0x1" edc:name="DMA1ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIP" edc:mask="0x1" edc:name="DMA1AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="IPR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x49F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIP" edc:mask="0x1" edc:name="SPI1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIP" edc:mask="0x1" edc:name="SPI1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IP" edc:mask="0x1" edc:name="SPI1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IP" edc:mask="0x1" edc:name="TMR2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IP" edc:mask="0x1" edc:name="TMR1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIP" edc:mask="0x1" edc:name="TMR1GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IP" edc:mask="0x1" edc:name="CCP1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IP" edc:mask="0x1" edc:name="TMR0IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnrrrr" edc:cname="IPR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIP" edc:mask="0x1" edc:name="U1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIP" edc:mask="0x1" edc:name="U1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIP" edc:mask="0x1" edc:name="U1EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IP" edc:mask="0x1" edc:name="U1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IP" edc:mask="0x1" edc:name="TMR3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIP" edc:mask="0x1" edc:name="TMR3GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIP" edc:mask="0x1" edc:name="PWM1PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IP" edc:mask="0x1" edc:name="PWM1IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnn-rn-" edc:cname="IPR5" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="IPR5" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC6IP" edc:mask="0x1" edc:name="CLC6IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AIP" edc:mask="0x1" edc:name="TU16AIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2IP" edc:mask="0x1" edc:name="C2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IP" edc:mask="0x1" edc:name="CLC2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIP" edc:mask="0x1" edc:name="PWM2PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP" edc:mask="0x1" edc:name="PWM2IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
